### Carregando base de dados

In [1]:
import pandas as pd
import numpy as np
import random

### Percentuais

In [2]:
dados = {'emprego' : ['Administrador_banco_dados', 'Programador', 'Arquiteto_reder'],
         'nova_jersey' : [97350,82080, 112840],
         'florida' : [77140, 71540, 62310]}

In [3]:
df = pd.DataFrame(dados)
df

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2            Arquiteto_reder       112840    62310

In [4]:
df['nova_jersey'].sum()

292270

In [5]:
df['florida'].sum()

210990

In [6]:
df['%nova_jersey'] = (df['nova_jersey']  / df['nova_jersey'].sum()) * 100

In [7]:
df['%florida'] = (df['florida']  / df['florida'].sum()) * 100

In [8]:
df

                     emprego  nova_jersey  florida  %nova_jersey   %florida
0  Administrador_banco_dados        97350    77140     33.308242  36.560974
1                Programador        82080    71540     28.083621  33.906820
2            Arquiteto_reder       112840    62310     38.608136  29.532205